{"[P1T1 Practical Programming]":{"What is a variable?":"Named locations in the memory of a computer that store data while a program is running, the value may change during the execution of the program","What is a data type?":"Determines what sort of data will be stored and how it will be handled in the program","What is a constant?":"A piece of data which cannot change throughout the running of the program","What are the advantages of a constant?":"Easier to debug, understand and update the code","What is an identifier?":"The name of a variable/constant which points to a memory location","What is assignment?":"Assigning a value to a memory location","What is a boolean operator?":"AND, OR, NOT","What is a boolean expression?":"Expression which equates to true or false","What is string manipulation?":"Ways of manipulating strings which are stored in variables","What is Exponentiation?":"Raising one quantity to the power of another","What is truncation?":"Shortening a value","What is a random number?":"A number drawn from a set of possible values, each of which is equally probable and unpredictable","What is a primitive data type?":"A predefined data type built into the language","What is an array?":"A group of items with a common data type stored under a single variable name","What is a 2D array?":"A collection of variables with a common data type, that uses a matrix with a number of rows and columns","What is an arraylist?":"A dynamic array which can be resized","What are exceptions?":"Events that occur when you try to execute a program that will end up interrupting the normal flow of instructions","What is a try-block?":"Contains a block of program statements within which an exception might occur","What is a catch block?":"Code that is executed when the code within the try block causes an exception","What is a finally block?":"Code that is executed regardless if an exception occurs or not","What is a subroutine?":"A named block of code that can be executed however many times","What is a local variable?":"A variable that can only be used in subroutines and functions that it is declared in","What is a global variable?":"A variable that be used anywhere in the program","What is variable scope?":"Where a variable may be used. Local scope is the subroutine it is declared in. Global scope can be used throughout the class","What is a parameter?":"A parameter is used to pass data between methods","What is a function?":"A subroutine that returns one or more values","What is a procedure?":"A subroutine that does not have to return a value","What are the advantages of subroutines?":"Can be called at any time, easier to debug, gives easier overview of program","What is a class?":"A blueprint of an object","What is an object?":"An instance of a class","What is a data structure?":"A collection of related data items bundled into one unit eg arrays, arraylist, records","What is a nested class?":"A class inside of another class","What is a data stream?":"Flows of characters from input / to input","What is a character stream?":"Read and write text characters that represent strings","What is a binary stream?":"Read and write individual bytes that represent primitive data types","What are binary files?":"Stores data in the form of 0s and 1s eg png file"},"[P1T2 Abstraction]":{"What is a hierarchy chart?":"A diagram which shows the design of the system from the top down - start at the top of the process and work your way down into the smaller sub-processes","What is a modular approach?":"A design approach that subdivides a system into smaller parts called modules that can be independently created and used in different systems","What are the advantages of modular programming?":"Large programs are broken down into subtasks that are easier to program and manage","What is a flowchart?":"Using a set of recognised symbols to show how the components of a system or a process work together","What is a data flow diagram?":"A DFD is a graphical representation of the 'flow' of data through an information system","What is psuedocode?":"A method of writing code that does not require knowledge of a particular programming language or it's syntax","What is an algorithm?":"A sequence of unambiguous instructions for solving a problem","What is a sequence?":"Putting the instructions in the right order within a program","What is selection?":"Choosing which action to take based on a set of criteria","What is iteration?":"Repeating a process","What is a hand-trace/dry run":"Process of stepping through each line of code to see what will happen before the program is executed. A trace table is used to record the result of each step in the dry run","What is representational abstraction?":"Representation arrived at by removing unnecessary details","What is abstraction by generalisation?":"Grouping common characteristics to arrive at a hierarchical relationship of the 'is a kind of' type","What is decomposition?":"Breaking a problem into a number of sub-problems which has an identifiable task","What is composition?":"Building up a whole system from smaller units (opposite to decomposition)","How is a composition abstraction built?":"By combining procedures to form compound procedures","How are data abstractions formed?":"By combining data objects to form compound data","What is procedural abstraction?":"Breaking up a problem into a number of procedures and subroutines","What is functional abstraction?":"Breaking up a problem into a number of common functions","What is information hiding?":"Concealing details behind an interface","Why is information hiding used?":"Allows users to understand something without understanding how it does it, keeps internal designs secret, programmers can change the code without the user needing to know","What is an interface?":"A boundary between a system and the outside world","What is data abstraction?":"The process of organising and structuring data. The system will hide certain details of how data is stored","What is problem abstraction/reduction?":"Removing details until the problem is reduced to sub-problems that have already been solved","What is automation?":"Building models of a real world objects in order to solve a problem","What is a good algorithm?":"Clear and precise steps that produce the correct output for any valid input, allows for invalid inputs, must eventually terminate, uses few steps as possible, understandable to other people","What is an insertion sort?":"An efficient algorithm for sorting a small number of elements by selecting an element and inserting it into the correct index","What is a bubble sort?":"Each element in the array is compared with every element in the same array and swapped if necessary","What is a linear search?":"Starts at the beginning of a list and examines every element until the item is found","What is a binary sort?":"Assuming the items are in sorted order, the search area is halved each time an item is examined","What is a finite state machine?":"An abstract representation of how something changes from one state to another in response to a condition or event","What are the rules of a finite state machine?":"The machine can only be in one state at a time, it can change state in response to an event/condition, defined by a list of its state and conditions for each transition","What is finite state automation?":"A FSM which has no output, has a start state and a set of end/accept states"},"[P1T3 Programming Paradigms]":{"What is procedural programming?":"A program consists of step-by-step instructions, local and global variables, calls to subroutines","What is a method (in stored procedure)?":"A method is a subroutine which is always called using the object of the class","What is a function (in stored procedure)?":"A subroutine where returning a value is optional. Functions can have only input parameters","Why is object oriented programming used?":"Modularity: source code written independently of other objects. Information Hiding: Interaction between objects, hide the method implementation. Pluggability/Debugging: Replacing objects instead of the whole source code","What is a constructor?":"A subroutine that creates objects based on the class","What is the purpose of a class?":"To define attributes and methods that capture the common characteristics and behaviours of an object","What is encapsulation?":"Attributes and methods are wrapped into a single entity","How is information hiding used in OOP?":"Object's attributes are hidden (private) can only be modified via accessors and mutators which are public","What is instantiation?":"Creating an object from the class blueprint","What is inheritance?":"Creating a new class based on an existing class (superclass). The new class is a subclass of the superclass and inherits all its attributes/methods","What is polymorphism?":"A method used in a class hierarchy can behave differently in each class. Achieved via overriding a superclass method with the same identifier","What is composition?":"If the containing object is destroyed so are objects it contains (filled diamond and a solid line)","What is association?":"The object remains when the container object is destroyed (unfilled diamond and a solid line)","What is an abstract method?":"A method which only consusts of a signature, and no implementation. The subclass must provide the implementation","What is a virtual method?":"Implementation can be redefined by subclasses","What is a static method?":"Relevant to all the instances of a class rather than to any specific instance, no owning object, and receives all information from its arguments","What are the three OOP principles?":"Encapsulates what varies, favour composition over inheritance, program to interfaces not implementation","What is an interface class?":"A group of methods with empty bodies"},"[P1T4 Data Structures]":{"What does the MOD function do?":"Returns the remainder after dividing two numbers","What is a primitive/elementary data type?":"Basic unit of a language which holds a single piece of data directly","What is a composite data type?":"Any data type which can be constructed using the language's primitive data types","What is an abstract data type?":"Describes various concepts in terms of their functionality without describing the particular implementation","What are the four distinct operations of a queue?":"Add item to rear, remove item from front, check if empty, check if full","What do pointers do in a queue?":"A front pointer points to the next item to be removed, and the rear pointer points to the last item added","What is a circular queue?":"A queue which reuses the spaces that have been freed by dequeueing from the front of the array","What is a priority queue?":"Certain items are allowed to 'jump' to a certain position in the queue","How does a priory queue work?":"Each item has a priority associated with it, the priorities are ranked in order","What is a static data structure?":"A data structure that is fixed in size, it cannot grow, shrink or be freed during execution eg Array","What is a dynamic data structure?":"A data structure that can allocate memory from the heap and can grow and shrink in size eg ArrayList","What is a list?":"A dynamic Abstract Data Type (ADT) where the implementation is hidden","What is a stack?":"An Abstract Data Type (ADT) where data is added to the top, and removed from the top","What is an overflow error?":"Attempting to push onto a stack that is full","What is an underflow error?":"Attempting to pop from a stack that is empty","What operations does a stack use?":"Append - add to the top, Pop - remove item from top, Len - find the length of the stack","What is the call stack?":"A system level data structure for passing parameters and return addresses to subroutines","What is a stack frame?":"Contains all the parameters, the return address and the local variables for a single call to a subroutine which has not yet completed","What is a hash algorithm?":"An algorithm that stores data in a memory address derived from the input-data itself","What is a collision in hashing?":"When an algorithm generates the same address for different primary keys","How are collisions dealt with in hashing?":"Put the item in the next free slot, although this leads to clustering of items in a table. Hence, add 1,3,5,7 etc instead of incrementing by 1 to find a free space","In hashing, as the load factor increases, how are collisions avoided?":"The table size needs to be large enough so that the load factor is not more than about 50%-70% of the table size","What is the folding method?":"Dividing a number into equal pieces and add them together, then used the mod function to get the address","What is a Dictionary?":"An abstract data type made up of associated pairs, each pair has a key and a value. The value is accessed by the key","What is a graph?":"An Abstract Data Structure representing complex relationships, it is a set of vertices or nodes connected by edges or arcs","What is an undirected graph?":"A graph where there are no arrows on the edges indicating direction, the graph is bidirectional","What is a directed graph?":"A graph which has arrows on the edges that shows directions between different nodes","What is an unweighted graph?":"There are no weights associated with the edges","What is an adjacency matrix?":"Each row and column represents a node, the item at [row, column] indicates a connection","What are the advantages and disadvantages of an adjacency matrix?":"Convenient to work with, adding an edge is simple. However a sparse graph with little edges will leave many empty cells, wasting memory","What is adjacency list?":"A dictionary that maps the nodes and edges, with their weights. It only uses storage for the connections that exist, so it is more space efficient","What is depth-first traversal?":"Traverse down each path and upon reaching a leaf node, you backtrack to the previous parent node and go down the next path","What is breadth-first traversal?":"You visit each level/layer of the tree","How does a depth-first traversal work?":"Uses a stack to keep track of the last node visited, and a list to hold the nodes that have been visited","How does breadth-first traversal work?":"Every child node to the root node is queued, traverse through the queue and add each child node to the same queue. A separate list called visited is required","How do you decide whether to use breadth or depth first search?":"Breadth-first search is better for searching from top to bottom (eg dead family members in a family tree). Depth-first search is better for searching down to the bottom of each path (eg alive people in a family tree)","What is recursion?":"When a procedure/subroutine calls itself, after each call is done, a test is done to see if it must call itself again","What does factorial mean?":"n! is the product of all numbers between 1 to n. eg 5! is 1x2x3x4x5","What are the three characteristics of a recursion routine?":"Stopping condition or base case to allow the recursion to 'unwind'. The base case must be reached after a finite number of calls. For input values other than the base case, the routine must call itself","What is a tree?":"A connected, undirected graph with no cycles","What is a rooted tree?":"One node is identified as the root node","What is a binary tree?":"A rooted tree in which each node has a maximum of two children","What is a balanced binary tree?":"When the nodes are distributed in such a way that the levels below the root are kept to a minimal for more efficient searching","What is a vector?":"A vector has both magnitude (length) and direction","What is a scalar?":"A scalar only has magnitude","Why are vectors used?":"Images are defined as paths, not distinct bit patterns. Rules of mathematics allow scaling without distortion","What is the notation of a vector?":"Location indicator is used, ' S = {0, 1, 2, 3} -> [2.55, -3.88, 4.11, 5.77] ' where '->' means 'maps to'","With Vectors, what is R notation?":"R^n indicates what dimension the vector is, eg R^3 for a 3D vector","What is convex combination of vectors?":"The area between two vectors, expressed in the form 'w = ua + bv' where 'a + b = 1' and 'a or b >= 0'","What is dot product?":"Method for multiplying to vectors (u . v). Multiply each component of the first vector by each component of the second vector and adding them together","What is the dot product formula to get the angle between two vectors?":"cos(x) = (A.B)/(|A|*|B|)","What is the Galois field?":"Galois Field is given to a set that consists of a finite number of items"},"[P1T5 Algorithm Fundamentals]":{"What is Dijkstra's shortest path algorithm?":"An algorithm that finds the shortest path between a start node and every other node in a weighted graph","How does Dijkstra's shortest algorithm work?":"Uses a priority queue as the supporting data structure to keep a record of which vertex to visit next. Temporary distance 0 at the start node, infinity at every other node.","What is a binary search?":"Examines the middle of the list, discards the top or bottom if the index is not found and repeats","What is the time complexity of a binary tree?":"O9=(log^2n) because half the choices are discarded on each comparison","How does a merge sort work?":"Divides the unsorted list into n sublists with one element each, repeatedly merge two sublists at a time until one one list remains","What is the time complexity for a merge sort?":"O(nlogn) because the data is halved but requires n operations to merge the data into a single list"},"[P1T6 Context Free Languages]":{"What is a Finite State Machine?":"An abstract model of computation to design sequential logic circuits, tests for valid syntaxes or computer programs","In a finite state machine, what is the final state known as?":"The end state or accept state","What does an arrow mean in a finite state machine?":"A transition","What is a Mealy machine?":"A finite state machine which generates an output on each state transition which is determined by its current state and input","What is a set?":"An unordered, well defined collection of objects containing unique elements, usually denoted via a capital letter","What does | mean?":"Given that. eg 'x | x is even'","What does ^ mean?":"And. eg: 'x is even ^ y is odd'","What is the 'u' Set Operator?":"A u B is the set of all members in A and B","What is the n set operator?":"A n B is a set of members that are in both A and B","What is a subset?":"A is a subset of B when every member of A is also a member of B","When is a set not a subset of another set?":"A is not a subset of B if at least one member of A does not belong to B","What is a proper subset?":"A is a proper subset of B when A is a subset of B but B does not equal A","What is a Cartesian product?":"A mathematical operation that returns a set from multiple sets, by combining each element from each set","What is the Cartesian plane?":"An ordered pair (a, b) of real numbers appears on R*R (grid of real numbers)","What is a finite set?":"A set with an exact number of distinct members","What is cardinality?":"The number of elements in a finite set","What is an infinite set?":"The set contains an infinite number of distinct members","What is a countably infinite set?":"A set whose members can be counted using the infinite set N (natural numbers)","What is a regular expression?":"Describes a pattern of text using special notation","What does | mean in regex?":"Separates alternatives (or)","What does * mean in regex?":"Zero or more of the element","What does + mean in regex?":"One or more of the element","What does ? mean in regex?":"Zero or one of the element","A language is regular if?":"It can be represented by regex or a finite state machine","What is Backus-Naur Form?":"The formal notation used to describe syntax rules of a language, a language that describes a language (meta language)","What does ::= mean in Backus-Naur Form?":"Is defined as. eg '<one> ::= 1'","What are < and > used for in Backus-Naur Form?":"Surrounds a category name","What is a terminal symbol in Backus-Naur Form?":"A symbol that cannot be further broken down","What is a non-terminal symbol in Backus-Naur Form?":"A symbol that can be broken down further. eg '<string> ::= <int>|<character>'","What is each statement in Backus-Naur Form known as?":"A production rule","What is parsing in Backus-Naur Form?":"Checking an input string against the set of Backus-Naur Form rules to see if it is valid","In Reverse Polish Notation, what is infix?":"The operator comes between the operands","In Reverse Polish Notation, what is prefix?":"The operator comes before the operands","In Reverse Polish Notation, what is postfix?":"The operator comes after the operands","Why is Reverse Polish Notation used?":"Eliminates the need for brackets, evaluated using a stack, reduce computer memory","How is a negative number represented in Reverse Polish Notation?":"A ~ is used instead of a -","What are the components of the Turing Machine?":"The tape that the machine can read and write to, which is infinitely long, and the controller (program) which determines what happens at each cell","What are the requirements of a Turing Machine?":"Must have at least one halting state, a 0, 1 and [] (blank) symbol must be used to represent data","What is the controller in a Turing Machine?":"A finite state machine which tells the machine to do next, it can read the new symbol on the tape, erase/write new symbol on tape or move the head left or right by one unit","Why are Turing Machines important?":"It provides a definition of what is computable","What is a Universal Turing Machine?":"Simulates the behaviour of any Turing Machine"},"[P1T7 Algorithm Classification]":{"What is Big-O notation?":"A measure of time complexity for an algorithm eg O(n), O(!n)","How is Big-O simplified?":"Uses the largest nth term eg T(n) = 4n + 2 means T(n) = O(n)","How is Big-O calculated?":"Count the number of assignment statements in the algorithm. Nested for loops of length n is n^2","What is a permutation?":"A permutation of n items is the number of ways the n items can be arranged","What are the two types of permutation?":"Repetition allowed: Combination lock with 4 digits from 0 to 9. No repetition allowed: 4 different coloured balls in a bag, drawn one at a time","How is a problem defined as computable?":"If an algorithm can solve every instance of it","What is a computational problem?":"A collection of questions that computers might be able to solve","What are two limits of computation imposed by?":"Algorithmic complexity and hardware","What is a brute force method?":"Tests every possible route","What is a tractable problem?":"Problems that have a reasonable time solution","What is an intractable problem?":"An intractable problem is one that does not have a polynomial time solution (unreasonable time) O(2^n), O(n!)","What is a heuristic approach?":"One which tries to find a solution which may not be perfect but which is adequate for its purpose","What is the Halting problem?":"This is the problem of determining whether a program will finish running or continue forever given an input","What does the halting problem show?":"That some problems are not computable (cannot be solved by a computer)"},"[P2T1 Data Representation]":{"What is a Natural Number?":"A positive whole number","What is the mathematical symbol for a Natural Number?":"N","What is an Integer?":"A whole number that is positive or negative","What is the mathematical symbol for an integer?":"Z","What is a Rational Number?":"A number which can be expressed as a fraction","What is the mathematical symbol for a Rational number?":"Q","What is an irrational number?":"A number which cannot be represented as a ratio of integers because the decimal equivalent would go on forever without a repeating pattern","A number is rational if it is both?":"Terminating and repeating","What is a Real number?":"Any positive or negative value which does or does not have a fractional part","What is the mathematical symbol for Real numbers?":"R","What are Ordinal numbers?":"A number that identifies the position of something in a list","What does low voltage mean?":"Closed circuit or 0","What does high voltage mean?":"Open circuit or 1","What is a bit?":"Stores a 0 or a 1","What is a byte?":"A group of 8 bits","What number system does binary use?":"Base 2","What is the formula for the largest binary number from a set of bits?":"(2^n) - 1","What number system does Hexadecimal use?":"Base 16","What is a nibble?":"4 bits","Why is hexadecimal used?":"You can write more large binary numbers in a shorter number of digits and it is easier for humans to read","A binary prefix ending in 'bi' uses what number system?":"Base 2","A decimal prefix such as kilo, mega or giga uses what number system?":"Base 10","Which bit is often referred to as the Most Significant Bit (MSB)?":"Leftmost","Which bit is often referred to as the Least Significant Bit (LSB)?":"Rightmost","Using 2s Complement, a binary number starting with 0 means what?":"The number is positive","Using 2s Complement, a binary number starting with 1 means what?":"The number is negative","What is a character code?":"A binary representation of a particular letter, number or special character","What does ASCII stand for?":"American Standard Code for Information Interchange","How many characters does ASCII support?":"128 (2^7)","How many characters does extended ASCII support?":"256 (2^8)","What is unicode?":"A standard allowing computers to represent text in most of the world's writing systems","How many bits does Unicode support?":"2^32","In binary addition, what is 0 + 0?":"0","In binary addition, what is 1 + 0?":"1","In binary addition, what is 1 + 1?":"10","What is a fixed point binary number?":"The binary (decimal) point is placed in a position that does not change","What are the advantages of a fixed point number?":"Simple to translate and good precision if the number range is known","What are the disadvantages of a fixed point number?":"The number range is limited and columns are potentially wasted","What happens past the binary point in a fixed point number?":"The decimal number in the previous column is divided by 2","What is normalising (floating point numbers)?":"The process of moving the binary point of a floating point number to provide the maximum level of precision for a given number of bits","Why is normalising used?":"To make best use of the available bits and to prevent a loss of bits causing a loss of accuracy","What are the rules of normalisation (floating point numbers)?":"1) Only 1 bit before the decimal point, 2) The bit before the point must be non-zero (denary only), 3) The bit before the point is the sign (binary only)","What is a precision error?":"When there is an insufficient amount of bits available for the mantissa","What is an absolute error?":"The difference between an actual number and the nearest value that can be represented","What is a relative error?":"A way of identifying the scale of an ansolute error (percentage)","What is a rounding error?":"Loss of value caused by rounding a number to the nearest value that may be stored","What is a cancellation error?":"An error that occurs during the addition of numbers of widely different sizes in a restricted number of bits","What is an underflow error?":"A number that is too small (close to zero) to be represented in the available number of bits","What is an overflow error?":"A number that is too large to be represented in the available bits","What is a parity check?":"Detects if the wrong amount of 1s turn up, and requests retransmission if so","What is Even Parity?":"Maintains an even amount of 1s. If there is already an even amount it will add a 0 to the front, if not, a 1","What is Odd Parity?":"Maintain an odd amount of 1s. If it has an even number of 1s, a 1 is added to the front, if not, a 0","What is majority voting?":"Each bit is sent 3 times, when received, the most common bit out of the 3 is used","What is check digit?":"A value added to the end of a number to ensure that the number has not been corrupted","What is a pixel?":"A pixel is the smallest unit of a digital image that can be displayed on a device","What does a light sensor do?":"It measures the intensity of a colour in each pixel","What is a bitmap (raster) graphic?":"Bitmap graphics are a grid of pixels, where each pixel is given a colour value","What is resolution?":"The number of total number of pixels used","What is the formula for image resolution?":"Width * Height","What is colour depth?":"The number of colour combinations (2^n)","How is the file size of an image calculated?":"Resolution * Bit depth","What is metadata?":"Data about data and is stored in the same file as the image data","What type of signal is analogue?":"Continuous","What type of signal is digital?":"Discrete","How are analogue sound samples recorded?":"Recorded via an amplifier, each sample is quantised to measure its wave height before it is translated to an integer value","What is sampling?":"An analogue signal is measured at regular points","What is the sample resolution?":"The number of bits (audio bit depth) used to record each measurement","What is the sampling rate?":"The (frequency) number of samples taken in one second, measured in Hertz","How is the file size of an audio sample calculated?":"Sample rate * resolution * length in seconds","What does Nyquist Theorem suggest?":"Samples must be twice the highest frequency in order to replicate the original sound wave (Fs > 2Fmax)","What frequencies can the human ear hear between?":"20Hz and 22kHz","What is MIDI?":"Musical Instrument Digital Interface creates sound from an instrument or piece of software, a synthesised sound","What are the benefits of MIDI?":"The full sound signal does not need to be transmitted, only the instructions which reduces data transfer","What is Encryption?":"A way of making sure data cannot be understood if you don't possess the means to decrypt it","What is encryption used for?":"Sending data over a network securely","How does the Caesar Cipher work?":"Letters of the alphabet are shifted by a consistent amount","What is a Brute Force Attack?":"An attack that attempts every possible key to decrypt the ciphertext until one works","What is frequency analysis?":"Analysing what letters occur most often","What is symmetric encryption?":"(private key cryptography) uses one key to encrypt and decrypt data","What is asymmetric encryption?":"(public key cryptography) uses a public key to encrypt data and a private key (hidden) to decrypt it","How does a Vernam cipher work?":"Plaintext is merged with a key in equal length using a XOR logic gate to produce the ciphertext. The plaintext is then achieved by merging the ciphertext with the key using a XOR logic gate","How can a one-time pad be truly random?":"Generated from a physical or unpredictable phenomenon such as atmospheric noise, radioactive decay or lava lamps","What is the difference between hashing and encryption?":"Hashing is one way. Information that is encrypted can be decrypted","What is a dictionary attack?":"A method of entering every word in the dictionary as a password","What makes a strong encryption?":"No pattern matching can be done (repeated letters or vowels)","What is lossy compression?":"Non-essential data is permanently removed","What is lossless compression?":"Patterns in the data are spotted and summarised in a shorter format without permanently removing any information","What is run length encoding?":"A basic method of compression that summarises consecutive patterns of the same data","What is dictionary compression?":"Spots regularly occurring data and stores it separately in a dictionary"},"[P2T2 System Architecture]":{"What is hardware?":"The electronic physical components, both internal and external, that make up the computer","What is software?":"Sequences of instructions called programs that can be understood and executed by hardware","What software families come under System Software?":"Operating systems, library programs, utility programs, programming language translators","What is a library program?":"A collection of compiled routines that other programs can use","What is a utility program?":"A program that performs a specific task related to working with computers, eg file compression","What is an operating system?":"Provides an interface between the user and hardware to provide a 'virtual' machine. Hides the complexity of the hardware from the user. Provides a software platform on which other programs can run","What is a programming language translator":"Converts source code into object code (machine code) eg assembler, compiler, interpreter","What is an assembler?":"Translates assembly code into machine code. Converts each mnemonic into its binary equivalent","What is a compiler?":"A program that translates high level source code into object code all at once","What is an interpreter?":"Translates one line at a time at run time","What types of software come under Application Software?":"General purpose software, special purpose software, bespoke application software","What is general purpose software?":"Type of application that can be used for a variety of tasks","What is special purpose software?":"Type of software created to execute one specific task","What is bespoke application software?":"Tailor made software for a specific user and purpose","What are the two main software families?":"System software and application software"},"[P2T3 Logic]":{},"[P2T4 Systems Life Cycle]":{},"[P2T5 Databases]":{},"[P2T6 Networks]":{},"[P2T7 Functional Programming]":{},"[P2T8 Computing Consequences]":{"What are ethics?":"Moral principles that govern a person's behaviour or the conducting of an activity","What are morals?":"Morals are concerned with the principles of right and wrong behaviour and the good or badness of human character","What is the law?":"A system of rules which a particular country or community recognises as regulating actions of its members and which it may enforce by the imposition of penalties","What is a professional code of conduct?":"Becoming a member of a certified company that essentially enforces you to follow their code of conduct to signify you are a trustworthy and ethical employee","What cultural issues are there?":"Overuse of data / dependencies on data, invasive technologies & data collection without consent, over-reliance on computers, global influence via technology","What is GDPR?":"The General Data Protection Regulation is a law on personal data protection in the EU","What is the Freedom of Information Act?":"An act that creates a public 'right of access' to information held by public authorities","What is the Computer Misuse Act?":"Designed to protect users against theft of information, hacking and unauthorised computer access","What is the Regulation of Investigatory Power Act?":"Regulates the power of public bodies to carry out surveillance and investigation and the interception of communications","What is the Copyright, Designs and Patents Act?":"Gives content creators the right to control the ways in which their material may be used","What is the Health and Safety at Work Act?":"Defines the fundamental structure and authority for the encouragement of health, safety and welfare in the workplace","What is the Equality Act?":"Anti-discrimination law to protect individuals from unfair treatment","What is the Official Secrets Act?":"Provides for the protection of state secrets and official information for national security","What is the Defamation Act and Obscene Publications Act?":"Created a new offence for publishing obscene material, and allows police to seize such material"},"[Computing Keywords]":{"Absolute Error":"The difference between the actual number and the nearest representable value.","Abstract data type (ADT)":"A data type whose properties are specified independently of any particular programming language.","Abstraction":"Representation that is arrived at by removing unnecessary details.","Aggregation":"A type of association where the aggregated object has a weaker form of association with the objects that it is aggregating than is the case with composition. These objects have an existence independent of the aggregated object and can continue to exist even after the aggregated object is disposed of.","Ajax":"Web technology that allows only the part of a web page that needs updating to be fetched from the web server.","Algorithm":"A sequence of unambiguous instructions for solving a problem. It can be represented as a Turing machine program.","Application programming interface (API)":"A layer of software that allows application programs to call on the services of the operating system.","Association":"If the relationship is not inheritance or aggregation it is an association.","Asymptotic behaviour of f":"Behaviour of the function f(n) for very large values of n.","Asynchronous serial data transmission":"Transmission system in which the sender and receiver have separate clocks which are not kept synchronised. Instead, the clocks are synchronised temporarily at the start of a transmission. The arrival of data cannot be predicted by the receiver; s a start bit is used to signal the arrival of data and to synchronise the transmitter and receiver temporarily.","Attribute":"A property or characteristic of an entity (databases) or an object (OOP).","Automation":"Turning an abstraction into a form that can be processed by a computer.","Backus-Naur Form, (BNF)":"Backus-Naur Form, (BNF)","Bandwidth":"For a transmission medium, the range of signal frequencies it may transmit.","Base case":"A value that has a solution which does not involve any reference to the general case solution.","Baseband system":"A system that uses a single data channel system in which the whole bandwidth of the transmission medium is dedicated to one data channel at a time.","Basic operation":"The operation which contributes most to the total running time.","Baud rate":"The rate at which signals on a wire may change.","Behaviours":"The functions of the object or what the object does.","Bit rate":"The number of bits transmitted per second.","Broadband":"A multiple data channel system in which the bandwidth of the transmission medium carries several data streams at the same time.","Bubble sort":"A sorting algorithm where during a pass, neighbouring values are compared and swapped. Passes are made until no further swaps are needed.","Cipher text":"Message data after it has been encrypted.","Circular queue":"When the array element with the largest possible index has been used, the next element to join the queue reuses the vacated location at the beginning of the array.","Class definition":"A template that can be used to create objects of that class.","Client":"A computer that uses the services provided by a server.","Client-server system":"A system in which some computers (the clients), request services provided by other computers, the servers.","Closed path/circuit":"A sequence of edges that start and end at the same vertex and such that any two successive edges in the sequence share a vertex.","Communication protocol":"A set of agreed signals, codes and rules to be used for data and information exchange between computers.","Complexity of a problem":"Taken to be the worst case complexity of the most efficient algorithm which solves the problem.","Composite key":"A combination of attributes that uniquely identifies a tuple/record.","Computational complexity":"A measure of how economical an algorithm is with time and space.","Composition":"A type of association where the composite object has ownership of the objects within it. The objects that are part of the composite objects have a lifecycle determined by the composite object. If the composite object ceases to exist then they too will cease to exist.","Conceptual model":"A representation of the data requirements of an organisation constructed in a way that is independent of any software that is used to construct the database.","Cryptanalysis":"A method of trying to find the plain text from the cipher text without the decryption key.","Cryptography":"The science of designing cipher systems.","Cycle":"A closed path in which all the edges are different and all the intermediate vertices are different.","Data Model":"A method of describing the data, it's structure, the way it is interrelated and the constraints that apply to it for a given system or organisation.","Data transmission":"Movement of data.","Database":"A structured collection of data.","Database management system":"A software system that enables the definition, creation and maintenance of a database and which provides controlled access to this database.","Decryption":"Using an algorithm and a key to convert encrypted message data into its plain text equivalent.","Degree (of a vertex)":"The number of neighbours for that vertex.","Degree of relationship":"Between two entities, it refers to the number of entity occurrences of one entity which are associated with just one entity occurrence of the other and vice versa.","Deterministic finite state machine (FSM)":"An FSM that has just one next state for each pair of state and input symbols.","Directed graph":"A diagram consisting of vertices, joined by directed edges.","Dynamic allocation":"Memory space is only allocated when required at runtime.","Dynamic data structure":"The memory taken up by the data structure varies at run time.","Dynamic web page content":"Content that is generated when the web browser request is received.","Embedded computer system":"A dedicated computer system with a limited or non-existent user interface and designed to operate completely, or largely, autonomously from within other machinery.","Encapsulation":"Combining a record with the procedures and functions that manipulate it to form a new data type; a class in OOP.","Encryption":"Using an algorithm and a key to convert message data into a form that is not understandable without that key.","Entity":"An object, person, event or thing of interest to an organisation and about which data are recorded.","Evaluation":"A systematic assessment of whether something meets its objectives or specifications and how well it meets the latter in terms of effectiveness, usability, maintainability.","Explorer's problem":"The solution finds a route that traverses each road exactly once before returning to the starting point.","Exponential growth":"Growth that has the form kn, e.g. 2n where k = 2 and n = 1, 2, 3, etc.","Exponential time algorithm":"An algorithm whose execution time grows exponentially with input size.","Feasibility study":"A study that investigates the potential of a new system.","Finite state machine":"A finite state machine is a model of computation for a machine that is always in one of a fixed number of states. The state of the machine can be changed according to transition rules, based  upon the input that it receives and its current state. Some finite state machines produce output as they carry out transitions whilst others simply produce a yes/no response at the end of processing their input.","Floating point notation":"A real number represented by a sign, some significant digits (the mantissa) and a power of 2 (the exponent).","Foreign key":"An attribute in one table that is a primary key in another table.","Gateway":"A device used to connect networks using different protocols so that information can be successfully passed from one system to another.","General case":"The solution in terms of itself for a value n.","Graph":"A diagram consisting of vertices joined by edges.","Halting problem":"The unsolvable problem of writing a program that can tell whether a given program and its inputs will halt, without running the given program.","Halting state":"A state that has no outgoing transition.","Handshaking protocol":"The sending and receiving devices exchange signals to establish that they are each ready to initiate data transfer.","Heuristic":"An approach that uses experience to make informed guesses that assist in finding a polynomial time solution to an intractable algorithmic problem. The 'solution' may be non-optimal.","Human-computer interaction":"The study, planning and design of what happens when a computer and human work together.","Inheritance":"The relationship between two object types in which one is a kind of the other and shares some of its properties or behaviours.","Instantiation":"An object is defined based on a class.","Internet":"A global wide area network that is formed from the interconnection of many other networks and that uses the TCP/IP protocol.","Interpreter":"An interpreter works its way through a set of source code instructions identifying the next instruction and then running routine(s) to execute it, before moving on to the next instruction.","Intractable":"A problem which can be solved, but for which no polynomial time solution (or better) has been found.","Labelled or weighted graph":"A graph in which the edges are labelled or given a value called its weight.","Linear queue":"Elements join the queue at one end and leave the queue at the other.","Linear search":"Starts at the beginning of the list and compares each element in turn with the required value until a match is found, or the end of the list is reached.","Linear time algorithm":"An algorithm that executes in O(n) time.","List":"A collection of elements with an inherent order.","Maintainability of software":"How easy it is to fix bugs, change parameters and respond to changing requirements.","Maintenance":"Fixing bugs, changing parameters and responding to changing requirements.","Mealy machine":"A finite state machine (FSM)that determines its outputs from the present state and from the inputs.","Model":"An abstraction of an entity in the real world or in the problem that enables an automated solution. The abstraction is a representation of the problem that leaves out unnecessary detail.","Neighbours":"Two vertices are neighbours if they are connected by an edge.","Non-computable":"An algorithmic problem that admits no algorithm.","Normalisation":"A technique used to produce a normalised set of entities in a database.","Normalised entities":"A set of entities that contain no redundant data.","Null pointer":"A pointer that does not point to anything, usually represented by Ø or –1.","Object":"An instance of a class.","Operating system role":"To manage the hardware resources in order to provide for an orderly and controlled allocation of the processors, memories and I/O devices among the various programs competing for them and manage the storage of data. It hides the complexities of the hardware from the user.","Order of complexity":"Of a problem is its big O complexity.","Overflow":"The result of a calculation is too large to be represented using the available number of bits.","Parallel data transmission":"Multiple bits are sent down several wires simultaneously.","Peer-to-peer network":"A network that has no dedicated servers. All computers are of equal status and can both share resources themselves and use resources from other computers, ie they are peers.","Pharming":"When a phisher changes DNS server information so that customers are directed to another site.","Phishing":"When someone tries to get you to give them your personal information.","Plain text":"Message data before it is encrypted.","Pointer":"A variable that contains a memory address. The pointer 'points' to the memory location with that address.","Pointer type":"A variable of pointer type that stores an address of a data value.","Polymorphism":"Giving an action one name that is shared up and down a class hierarchy. Each class in the hierarchy implements the action in a way appropriate to itself.","Polynomial growth":"Growth that has the form nk, e.g. n3 where k = 3 and n = 1, 2, 3, etc.","Polynomial time algorithm":"An algorithm whose execution time grows as a polynomial of input size.","Precision":"The maximum number of significant digits that can be represented.","Primary key":"An attribute or set of attributes which uniquely identifies a tuple.","Principle of universality":"A universal machine is a machine capable of simulating any other machine.","Priority queue":"Each element of a priority queue has an associated priority.","Prototype":"An early or trial working version of the proposed system developed to test possible solutions.","Prototyping":"Building a working model, demonstration system, simplified version, rough copy or trial piece of software to help an analyst.","Pseudo-random numbers":"A series of numbers generated by computer with apparent randomness.","Queue":"A first-in-first-out (FIFO) abstract data type.","Recursive definition":"One that is defined in terms of itself.","Recursive routine":"A routine defined in terms of itself.","Referential integrity":"If a value appears in a foreign key in one table it must also appear in the primary key in another table.","Regular expression":"A notation for defining all the valid strings of a formal language or a special text string for describing a search pattern.","Regular language":"Any language that a finite state machine (FSM) will accept.","Relation":"A set of attributes and tuples, modelling an entity (a table).","Relational database":"A collection of tables which can be linked together by means of primary and foreign keys.","Relationship":"An association or link between two entities.","Relative error":"The absolute error divided by the actual numbers.","Robust code":"The program will function reliably and not crash or go into infinite loops, even with incorrect inputs or unpredictable values.","Rooted tree":"A tree in which one vertex has been designated as the root and every edge is directed away from the root.","Router":"A device that receives packets or from one host (computer) or router and uses the destination IP address that they contain to pass them correctly formatted, to another host (computer) or router.","Serial data transmission":"Single bits are sent one after another along a single wire.","Server":"A computer that provides shared resources to network users.","Significant digits":"Those digits which carry meaning contributing to the accuracy of a number. This includes all digits except leading and trailing zeros where they serve merely as placeholders to indicate the scale of the number.","Simple graph":"A graph without multiple edges in which each edge connects to two different vertices.","Software as a service (SaaS)":"A model of software deployment where an application is hosted as a service provided to customers across the internet.","Space-complexity (of an algorithm)":"How much memory an algorithm needs.","Stack":"A last-in-first-out (LIFO) abstract data type.","Stack frame":"The locations in the stack area used to store the values referring to one invocation of a routine.","Stand-alone computer":"A computer not networked, requiring its own printer and other peripherals plus its own installation of application software.","State transition diagram":"A directed graph whose nodes represent the states. An edge leading from state s to state t is called a transition and is labelled with a symbolic code, eg a | b. The a part of the label is called the transition’s trigger and denotes the input symbol. The b part, which is optional, denotes the output symbol.","Static data structure":"The memory required to store the data structure is declared before run time.","System software":"A program that manages the operation of a computer.","Thin-client network":"A network where all processing takes place in a central server; the clients are dumb terminals with little or no processing tower or local hard disk storage.","Time-complexity (of an algorithm)":"How fast an algorithm runs, expressed as a function of the number of input values.","Topology (networks)":"The shape, configuration or structure of the connections that connect device to the network.","Tractable":"A problem that has a reasonable (polynomial) time solution as the size of the input increases.","Transition function":"Maps (input symbol, current state) to (output symbol, next state, direction of movement).","Transition table":"Tabulates the mappings (input symbol, current state) to (output symbol, next state, direction of movement) for all inputs.","Traveller’s problem":"The solution finds a route that visits each city exactly once before returning to the starting point.","Tree":"A connected undirected graph with no cycles.","Trojan":"A program that hides in or masquerades as desirable software, such as utility or a game, but attacks computers it infects.","Tuple":"A set of attribute values in a database.","Turing machine (TM)":"A formal model of computation that consists of a finite state machine (FSM) that controls one or more tapes, where at least one tape is of unbounded length (ie infinitely long).","Undecidable":"Describes a decision-type algorithmic problem that is non-computable.","Underflow":"The result of a calculation is too small to be represented using the available number of bits.","Universal TM, UTM":"A universal Turing machine can simulate any other Turing machine. A UTM, U, is an interpreter that reads the description <M> of any arbitrary Turing machine M and faithfully executes operations on data D precisely as M does. For single-tape Turing machines, it is imagined that <M> is written at the beginning of the tape, followed by D.","Usability":"The ease with which a user interface can be used by its intended audience to achieve defined goals.","Virtual machine":"The apparent machine that the operating system presents to the user, achieved by hiding the complexities of the hardware behind layers of operating system software.","Virus (computer)":"A small program attached to another program or data file. It replicates itself by attaching itself to other programs.","Volumetrics":"Measurement or assessment of the volume of data that a system will be required to process and store.","Web 2.0":"Software that becomes a service that is accessed over the Internet.","Web server extension":"A program written in native code, ie an executable or a script that is interpreted by an interpreter running on the web server that extends the functionality of the web server and allows it to generate content at the time of the HTTP request.","Web services":"Self-contained, modular applications that can be described, published, located and invoked over a network, generally the web.","WiFi":"Trademarked IEEE 802.11 technologies that support wireless networking of home and business networks.","Wireless network":"Any type of local area network (LAN) in which the nodes (computers or computing devices, often portable devices) are not connected by wires but use radio waves to transmit data between them.","Worm":"A small program that exploits a network security weakness (security hole) to replicate itself through computer networks."}}